<script setup lang="ts">
import QuestionItem from './QuestionItem.vue'
import { ref } from 'vue'
import type { Questions } from '@/types/views/landing/questions/questions'

const questions = ref<Questions[]>([
    {
        title: 'Условия выдачи займа',
        description: `
            <span>Чтобы получить деньги, нужно совершить несколько простых действий</span>
            <ol>
                <li>
                    Зарегистрируйтесь на сайте проекта: для этого нужно нажать кнопку «Получить деньги».
                </li>
                <li>
                    Заполните анкету с необходимыми данными (понадобится паспорт).
                </li>
                <li>
                    Введите данные банковской карты и активируйте сервис.
                </li>
                <li>
                    Выберите самое интересное предложение и оформите займ. После короткого рассмотрения заявки на карту поступит зачисление.
                </li>
            </ol>`,
        active: false,
    },
    {
        title: 'Как долго рассматривается заявка?',
        description: `
             <ol>
                <li>
                    Часто обстоятельства складываются так, что деньги нужны здесь и сейчас. Мы понимаем это и относимся к вашему времени, как к своему: чтобы вы могли получить займ в любой момент, работаем 24/7.
                </li>
                <li>
                    Чтобы заполнить анкету, вам потребуется около 3 минут, рассмотрение заявки займет еще 5 минут, — и по истечении этого срока вы получите деньги удобным способом.
                </li>
            </ol>
            `,
        active: false,
    },
    {
        title: 'Если я не успеваю вернуть займ?',
        description: `
             <ol>
                <li>
                    Согласуйте рефинансирование вашего займа. Вам предложат погасить сумму на более лояльных условиях, которые помогут избежать больших штрафов за просрочку платежа.
                </li>
            </ol>
            `,
        active: false,
    },
    {
        title: 'Получу ли я деньги с плохой кредитной историей?',
        description: `
            <ol>
                <li>
                    Мы понимаем, что ситуации могут быть разными, и работаем со всеми клиентами: подберем для вас организации, которые готовы работать с заемщиками даже при наличии плохой кредитной истории.
                </li>
                <li>
                    Факт: если вы кредитуетесь в организации, которая входит в реестр Центрального банка, вовремя выплаченные займы помогают улучшить вашу кредитную историю.
                </li>
            </ol>
            `,
        active: false,
    },
    {
        title: 'Сколько я могу получить и на какой срок?',
        description: `
            <ol>
                <li>
                    У пользователя сервиса есть возможность получить займ до 100 000 рублей на срок до 1 года
                </li>
            </ol>
            `,
        active: false,
    },
    {
        title: 'Переплаты и комиссии по займу?',
        description: `
            <ol>
                <li>
                    Комиссия за выдачу займа составляет 0%. Обязательное страхование жизни и здоровья заемщика отсутствует. Переплата по займу составляет от 0 рублей и зависит от условий индивидуального кредитного предложения подобранного для клиента.
                </li>
            </ol>
            `,
        active: false,
    },
])

const toggleOpen = function (index: number) {
    questions.value = questions.value.map((ques, i) => {
        if (index === i) {
            ques.active = !ques.active
        } else {
            ques.active = false
        }
        return ques
    })
}
</script>

<template>
    <ul class="items">
        <question-item
            v-for="(question, index) in questions"
            :key="question.title"
            :question="question"
            :index="index"
            @toggleOpen="toggleOpen"
        ></question-item>
    </ul>
</template>

<style scoped lang="scss">
@media (max-width: $mobile) {
    .items {
        max-width: 100%;
        margin: 0 auto;
    }
}
</style>
